app/views/clinics/_form.html.erb

    <%= f.label :entity_ids, "EPS asociadas" %><br>
    <%= f.collection_check_boxes :entity_ids, Entity.all, :id, :name %>
---
SELECT "entities".* FROM "entities"