app/views/clinics/show.html.erb

  <strong>Eps asociada:</strong>
  <% @clinic.entities.each do |entity|%>
---
SELECT "entities".* FROM "entities" INNER JOIN "clinics_entities" ON "entities"."id" = "clinics_entities"."entity_id" WHERE "clinics_entities"."clinic_id" = ?  [["clinic_id", 1]]