app/controllers/clinics_controller.rb

  def index
    @clinics = Clinic.all
---
SELECT "clinics".* FROM "clinics"

  def create
    @clinic = Clinic.new(clinic_params)

    respond_to do |format|
      if @clinic.save
---
INSERT INTO "clinics" ("name", "address", "eps_asociada", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "clinica 1"], ["address", "cll23#52b89"], ["eps_asociada", "cruz blanca, sura"], ["created_at", "2016-04-18 18:37:23.534913"], ["updated_at", "2016-04-18 18:37:23.534913"]]