app/controllers/clinics_controller.rb

SELECT "clinics".* FROM "clinics" INNER JOIN "clinics_entities" ON "clinics_entities"."clinic_id" = "clinics"."id" INNER JOIN "entities" ON "entities"."id" = "clinics_entities"."entity_id" WHERE (entities.id = 2)
SELECT "entities".* FROM "entities" INNER JOIN "clinics_entities" ON "entities"."id" = "clinics_entities"."entity_id" WHERE "clinics_entities"."clinic_id" = ?  [["clinic_id", 1]]
---
  def index
    @clinics = Clinic.joins(:entities).where("entities.id = ?", current_user.entity.id)

SELECT "clinics".* FROM "clinics"
---
  def all
    @clinics = Clinic.all

UPDATE "clinics" SET "name" = ?, "updated_at" = ? WHERE "clinics"."id" = ?  [["name", "clinica   5"], ["updated_at", "2016-04-18 18:40:00.885481"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @clinic.update(clinic_params)

SELECT "clinics".* FROM "clinics" WHERE (name LIKE '%vegas%')
---
  def search
    @clinics = Clinic.where("name LIKE ?", "%#{params[:q]}%")

SELECT  "clinics".* FROM "clinics" WHERE "clinics"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_clinic
      @clinic = Clinic.find(params[:id])