app/controllers/lists_controller.rb

SELECT  "clinics".* FROM "clinics" WHERE "clinics"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "lists" ("clinic_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["clinic_id", 1], ["user_id", 1], ["created_at", "2016-04-18 19:08:03.155130"], ["updated_at", "2016-04-18 19:08:03.155130"]]
---
  def add_to_wait_list
    clinic = Clinic.find(params[:id])
    @list = List.new
    @list.clinic = clinic
    @list.user = current_user
    @list.save

SELECT "lists".* FROM "lists" WHERE ( user_id = 1 AND created_at >= '2016-04-18' AND created_at <= '2016-04-19 04:59:59.999999')
---
    def set_list
      @list = List.find(params[:id])