app/controllers/users_controller.rb

  def save_sintoma
    current_user.update(sintomas: params[:sintomas])
---
UPDATE "users" SET "sintomas" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["sintomas", "dolo"], ["updated_at", "2016-04-18 18:36:54.870678"], ["id", 1]]